# Course 1: Week 1 - ML Overview

In [1]:
import pandas as pd

## Load a tabular data set

In [2]:
df = pd.read_csv('people-example.csv')

### dataframe basics

In [3]:
df.head() #we can view first few lines of table

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23

## Unique values of a column

In [4]:
df.Country.unique()

array(['United States', 'Canada', 'England', 'USA', 'Poland', 'Switzerland'], dtype=object)

In [5]:
df['age']

0    24
1    23
2    22
3    23
4    23
5    22
6    25
Name: age, dtype: int64

Some simple columnar operations

In [6]:
df['age'].mean()

23.142857142857142

In [7]:
df['age'].max()

25

## Create new columns in our dataframe

In [8]:
df['Full Name'] = df['First Name'] + ' ' + df['Last Name']

In [9]:
df

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown            USA   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward

In [10]:
df['age'] * df['age']

0    576
1    529
2    484
3    529
4    529
5    484
6    625
Name: age, dtype: int64

## Using the apply function

In [11]:
df['Country']

0    United States
1           Canada
2          England
3              USA
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [12]:
def transform_country(country):
    if country == 'USA':
        return 'United States'
    else:
        return country

In [13]:
transform_country('USA')

'United States'

In [14]:
df['Country'].apply(transform_country)

0    United States
1           Canada
2          England
3    United States
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [15]:
df['Country'] = df['Country'].apply(transform_country)

In [16]:
df

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown  United States   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward